;************************************************************************************************************
;XComGame.int - This File manages the text descriptions for my custom Perks, Classes & Class Nicknames
;Perks are organized A-Z with the Exception of GTS Perks which are in their own Section organized A-Z by Class
;Class Names, Descriptions & Nicknames are at the very bottom of this file
;Recommend Press CTRL + F and Type in what you are looking for
;************************************************************************************************************


;************************************************************************************************************
;Custom Perks A-Z (Except GTS)
;************************************************************************************************************

[InfuseWeapon_Dev X2AbilityTemplate]
LocFriendlyName="Infuse Weapon"
LocLongDescription="Apply Soulfire damage to your standard shot."
LocHelpText="Apply Soulfire damage to your standard shot."
LocFlyOverText="Infuse Weapon"
LocPromotionPopupText="<Bullet/>Applies Soulfire damage on top of damage from your standard shot and any equipped mods and ammo.<br/><Bullet/>Does not guarantee a hit.<br/><Bullet/><Ability:INFUSE_WEAPON_DEV_COOLDOWN/> turn cooldown.<br/>"

[StunProtocol_Dev X2AbilityTemplate]
LocFriendlyName="Stun Protocol"
LocLongDescription="Send your GREMLIN to stun an enemy."
LocHelpText="Send your GREMLIN to stun an enemy."
LocFlyOverText="Stun Protocol"
LocPromotionPopupText="<Bullet/>Targeted enemy is stunned for <Ability:STUN_PROTOCOL_DEV_TURNS/> turns.<br/><Bullet/><Ability:STUN_PROTOCOL_DEV_COOLDOWN/> turn cooldown.<br/>"

[WhisperStrike_Dev X2AbilityTemplate]
LocFriendlyName="Whisper Strike"
LocLongDescription="Movement during a Fleche attack does not reveal the unit until the attack is completed."
LocHelpText="Movement during a Fleche attack does not reveal the unit until the attack is completed."
LocFlyOverText="Whisper Strike"
LocPromotionPopupText="<Bullet/>Detection radius is reduced to zero for all enemies while performing the attack.<br/><Bullet/>Once attack is finished, unit may be detected by target or surrounding units.<br/>"

[Dismantle_Dev X2AbilityTemplate]
LocFriendlyName="Dismantle"
LocLongDescription="Send your GREMLIN to remotely destroy cover objects."
LocHelpText="Send your GREMLIN to remotely destroy cover objects."
LocFlyOverText="Dismantle"
LocPromotionPopupText="<Bullet/>Send GREMLIN to a location.<br/><Bullet/>Objects in that location are damaged and possibly destroyed completely.<br/><Bullet/>Deals no damage to enemies.<br/>"

[SpecialDelivery_Dev X2AbilityTemplate]
LocFriendlyName="Special Delivery"
LocLongDescription="Use your GREMLIN to deliver an explosive device directly to your enemies."
LocHelpText="Use your GREMLIN to deliver an explosive device directly to your enemies."
LocFlyOverText="Special Delivery"
LocPromotionPopupText="<Bullet/>Explodes a grenade at targeted location.<br/><Bullet/>Does not require line of sight.<br/>"

[BurnProtocol_Dev X2AbilityTemplate]
LocFriendlyName="Burn Protocol"
LocLongDescription="Send your GREMLIN to light an organic enemy on fire."
LocHelpText="Send your GREMLIN to light an organic enemy on fire."
LocFlyOverText="Burn Protocol"
LocPromotionPopupText="<Bullet/>Sets targeted enemy on fire.<br/><Bullet/>Deals half damage of Combat Protocol.<br/><Bullet/>Ability has <Ability:BURN_PROTOCOL_DEV_CHARGES/> charges.<br/>"

[GhostProtocol_Dev X2AbilityTemplate]
LocFriendlyName="Ghost Protocol"
LocLongDescription="Send your GREMLIN to provide a distraction to allow an ally to enter concealment."
LocHelpText="Send your GREMLIN to provide a distraction to allow an ally to enter concealment."
LocFlyOverText="Ghost Protocol"
LocPromotionPopupText="<Bullet/>Targeted ally enters concealment.<br/><Bullet/>One use per mission.<br/>"

[BoostProtocol_Dev X2AbilityTemplate]
LocFriendlyName="Boost Protocol"
LocLongDescription="Hack robotic ally to apply a boost to aim and critical chance."
LocHelpText="Hack robotic ally to apply a boost to aim and critical chance."
LocFlyOverText="Boost Protocol"
LocPromotionPopupText="<Bullet/>Target robotic ally to apply a series of permanent boosts.<br/><Bullet/>Increase aim by .<br/><Bullet/>Grants +<Ability:CONTROL_ROBOT_AIM_BONUS> Aim and +<Ability:CONTROL_ROBOT_CRIT_BONUS>% Critical Chance.<br/><Bullet/>One use per mission.<br/><Bullet/>Beware, hacked units will retain boost when hack terminates.<br/>"

[FullRecovery_Dev X2AbilityTemplate]
LocFriendlyName="Full Recovery"
LocLongDescription="Restore an ally to full heath and remove any negative mental or physical status effects: Poisoned, Burned, Acid, Disoriented, Stunned, Panicked, Bleeding Out, or Unconscious."
LocHelpText="Restore an ally to full heath and remove any negative mental or physical status effects."
LocFlyOverText="Full Recovery"
LocPromotionPopupText="<Bullet/>Restore an ally to full heath and remove Poisoned, Burned, Acid, Disoriented, Stunned, Panicked, Bleeding Out, or Unconscious.<br/><Bullet/>Can return a unit from Bleeding Out to full operability in a single action.<br/><Bullet/>Ability has +<Ability:FULL_RECOVERY_DEV_CHARGES> charges per mission.<br/>"

[HelpingHands_Dev X2AbilityTemplate]
LocFriendlyName="Helping Hands"
LocLongDescription="Gain +<Ability:HELPING_HANDS_DEV_MOBILITY_BONUS> Mobility when carrying a unit.  Putting a unit down is a free action."
LocHelpText="Gain mobility when carrying a unit."
LocFlyOverText="Helping Hands"
LocPromotionPopupText="<Bullet/>Gain +<Ability:HELPING_HANDS_DEV_MOBILITY_BONUS> Mobility when carrying a unit.<br/><Bullet/>Put Down Unit is no longer costs an action point.<br/><Bullet/>Allows for greater mobility when moving unconscious allies or targets.<br/>"

[Supercharge_Dev X2AbilityTemplate]
LocFriendlyName="Supercharge"
LocLongDescription="Fire your arcthrower at a mechanical ally to grant it an extra action."
LocHelpText="Fire your arcthrower at a mechanical ally to grant it an extra action."
LocFlyOverText="Supercharge"
LocPromotionPopupText="<Bullet/>Targeted Spark or hacked MEC/turret gains an extra action.<br/><Bullet/>Ability has <Ability:SUPERCHARGE_DEV_ABILITY_CHARGES/> charges.<br/>"

[StickAndMoveRS X2AbilityTemplate]
LocFriendlyName="Stick and Move"
LocLongDescription="Grants +<Ability:STICKANDMOVERS_DEFENSE/> Defense and +<Ability:STICKANDMOVERS_MOBILITY/> Mobility."
LocHelpText="Grants +<Ability:STICKANDMOVERS_DEFENSE/> Defense and +<Ability:STICKANDMOVERS_MOBILITY/> Mobility."
LocFlyOverText="Stick and Move"
LocPromotionPopupText="<Bullet/> Grants +<Ability:STICKANDMOVERS_DEFENSE/> Defense and +<Ability:STICKANDMOVERS_MOBILITY/> Mobility.<br/><Bullet/> This is a passive effect.<br/>"

[Resuscitate_Dev X2AbilityTemplate]
LocFriendlyName="Resuscitate"
LocLongDescription="Remove all negative mental status effects from adjacent ally.  Can appropriate supplies from medikits in inventory for additional uses."
LocHelpText="Remove all negative mental status effects from adjacent ally."
LocFlyOverText="Resuscitate"
LocPromotionPopupText="<Bullet/>Removes Disoriented, Stunned, Panicked, or Unconscious from adjacent ally.<br/><Bullet/>One use per mission plus an additional use per medikit charge.<br/>"

[NoScope_Dev X2AbilityTemplate]
LocFriendlyName="No Scope"
LocFlyOverText="No Scope"
LocLongDescription="You take shots more quickly than normal, allowing for greater mobility."
LocHelpText="Shoot the target."
LocPromotionPopupText="<Bullet/> The soldier may now use the sniper rifle for standard shots after moving, but suffers extreme aim penalties at targets beyond 22 tiles range on those shots.<br/><Bullet/> The soldier may not enter overwatch with the sniper rifle after moving.<br/><Bullet/> When wielding any other weapon, taking a standard shot with your primary weapon as your first action no longer ends your turn.<br/>"

[Stealth X2AbilityTemplate]
LocLongDescription="Immediately enter concealment twice per mission."
LocHelpText="Immediately enter concealment twice per mission."

[RepairProtocolRS X2AbilityTemplate]
LocFriendlyName="Repair Protocol"
LocLongDescription="Send the GREMLIN to Repair a robotic ally, restoring <Ability:REPAIRPROTOCOLRS_AMOUNTREPAIRED/> hit points."
LocHelpText="Send the GREMLIN to Repair a robotic ally, restoring <Ability:REPAIRPROTOCOLRS_AMOUNTREPAIRED/> hit points."
LocFlyOverText="Repair Protocol"
LocPromotionPopupText="<Bullet/> Can be used to repair robotic allies such as SPARKS and Hacked MEC units.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Repair Protocol has <Ability:REPAIRPROTOCOLRS_CHARGES/> Charges per Mission.<br/>"

;************************************************************************************************************
;GTS Perks
;************************************************************************************************************

;Psion

[PsionPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Psion: Hidden Potential"
Summary="Trains our Psions to unleash their Hidden Psionic Potential. Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense."

[HiddenPotentialRS X2AbilityTemplate]
LocFriendlyName="Hidden Potential"
LocLongDescription="Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense."
LocHelpText="Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense."
LocFlyOverText="Hidden Potential"
LocPromotionPopupText="<Bullet/>Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense.<br/>"

;************************************************************************************************************
;Class Names, Descriptions & Nicknames (A-Z by Class)
;************************************************************************************************************

[X2ExperienceConfig]
PsiRankNames[8]="Master"
PsiShortNames[0]="Rk"

[MarksmanDev X2SoldierClassTemplate]
DisplayName="Marksman"
ClassSummary="Our Marksman focus on extreme accuracy at both mid and long range.  They also use holotargeters to ensure their shots and the shots of their team hit the target."
LeftAbilityTreeTitle="Sniper"
RightAbilityTreeTitle="Sentry"
AbilityTreeTitles[0]="Sniper"
AbilityTreeTitles[1]="Shot Caller"
AbilityTreeTitles[2]="Sentry"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Apex"
RandomNickNames[1]="Ace"
RandomNickNames[2]="Aftermath"
RandomNickNames[3]="Alpha"
RandomNickNames[4]="Blackjack"
RandomNickNames[5]="Bullseye"
RandomNickNames[6]="Bolt"
RandomNickNames[7]="Big Shot"
RandomNickNames[8]="Big Sleep"
RandomNickNames[9]="Big Time"
RandomNickNames[10]="Boss"
RandomNickNames[11]="Bullseye"
RandomNickNames[12]="Checkmate"
RandomNickNames[13]="Chief"
RandomNickNames[14]="Colt"
RandomNickNames[15]="Dallas"
RandomNickNames[16]="Deadbolt"
RandomNickNames[17]="Deadeye"
RandomNickNames[18]="Deadlock"
RandomNickNames[19]="Deadwood"
RandomNickNames[20]="D.O.A."
RandomNickNames[21]="Eagle Eye"
RandomNickNames[22]="Eight Ball"
RandomNickNames[23]="Flatline"
RandomNickNames[24]="Game Time"
RandomNickNames[25]="Gangster"
RandomNickNames[26]="Grave Digger"
RandomNickNames[27]="Hat Trick"
RandomNickNames[28]="Hawkeye"
RandomNickNames[29]="Heater"
RandomNickNames[30]="High Noon"
RandomNickNames[31]="Hitman"
RandomNickNames[32]="Hollywood"
RandomNickNames[33]="Hype"
RandomNickNames[34]="Icon"
RandomNickNames[35]="Jackal"
RandomNickNames[36]="Judge"
RandomNickNames[37]="Lights Out"
RandomNickNames[38]="Lockdown"
RandomNickNames[39]="Long Shot"
RandomNickNames[40]="Longwalker"
RandomNickNames[41]="Needle"
RandomNickNames[42]="Pale Rider"
RandomNickNames[43]="Huntsman"
RandomNickNames[44]="Scratch"
RandomNickNames[45]="Serial"
RandomNickNames[46]="Sheriff"
RandomNickNames[47]="Shooter"
RandomNickNames[48]="Showtime"
RandomNickNames[49]="Slick"
RandomNickNames[50]="Slinger"
RandomNickNames[51]="Stonecold"
RandomNickNames[52]="The Cleaner"
RandomNickNames[53]="The Kid"
RandomNickNames[54]="The Truth"
RandomNickNames[55]="Tombstone"
RandomNickNames[56]="Top Notch"
RandomNickNames[57]="Top Shelf"
RandomNickNames[58]="Two Tap"
RandomNickNames[59]="Undertaker"
RandomNickNames[60]="Valentine"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Sandman"
RandomNickNames_Male[1]="Slim"
RandomNickNames_Male[2]="Taxman"
RandomNickNames_Male[3]="Zeus"
RandomNickNames_Female[0]="Baroness"
RandomNickNames_Female[1]="Black Widow"
RandomNicknames_Female[2]="Calamity"
RandomNicknames_Female[3]="Queen Bee"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Death From Afar"
PhotoboothSoloBLines_Male[1]="Go Ahead and Run. You'll Just Die Tired."
PhotoboothSoloBLines_Male[2]="King of Killshots"
PhotoboothSoloBLines_Male[3]="Right Between Their Alien Eyes"
PhotoboothSoloBLines_Male[4]="The Only Thing He Feels is Recoil"
PhotoboothSoloBLines_Male[5]="One shot, one kill."
PhotoboothSoloBLines_Male[6]="One shot, one kill. No luck, all skill."
PhotoboothSoloBLines_Male[7]="Patience is bitter, but its fruit is sweet."
PhotoboothSoloBLines_Male[8]="Guaranteed delivery."
PhotoboothSoloBLines_Male[9]="Save bullets.  Use a sniper."

PhotoboothSoloBLines_Female[0]="Death From Afar"
PhotoboothSoloBLines_Female[1]="Go Ahead and Run. You'll Just Die Tired."
PhotoboothSoloBLines_Female[2]="Queen of Killshots"
PhotoboothSoloBLines_Female[3]="Right Between Their Alien Eyes"
PhotoboothSoloBLines_Female[4]="The Only Thing She Feels is Recoil"
PhotoboothSoloBLines_Female[5]="One shot, one kill."
PhotoboothSoloBLines_Female[6]="One shot, one kill. No luck, all skill."
PhotoboothSoloBLines_Female[7]="Patience is bitter, but its fruit is sweet."
PhotoboothSoloBLines_Female[8]="Guaranteed delivery."
PhotoboothSoloBLines_Female[9]="Save bullets.  Use a sniper."

[GunnerDev X2SoldierClassTemplate]
DisplayName="Gunner"
ClassSummary="The Gunner is trained to use heavy automatic weapons, able to cover the squad with suppressive fire or inflict significant damage in direct attacks."
LeftAbilityTreeTitle="Punisher"
RightAbilityTreeTitle="Closer"
AbilityTreeTitles[0]="Punisher"
AbilityTreeTitles[1]="Closer"
AbilityTreeTitles[2]="Suppressor"
AbilityTreeTitles[3]="XCOM"

RandomNickNames[0]="Backfire"
RandomNickNames[1]="Baja"
RandomNickNames[2]="Bearcat"
RandomNickNames[3]="Brutal"
RandomNickNames[4]="Chainsaw"
RandomNickNames[5]="Flounder"
RandomNickNames[6]="Gameshow"
RandomNickNames[7]="Gonzo"
RandomNickNames[8]="Hawker"
RandomNickNames[9]="Kozmo"
RandomNickNames[10]="Lunchbox"
RandomNickNames[11]="Mangler"
RandomNickNames[12]="Meathook"
RandomNickNames[13]="Moose"
RandomNickNames[14]="Nanook"
RandomNickNames[15]="Nugget"
RandomNickNames[16]="Nuke"
RandomNickNames[17]="Ogre"
RandomNickNames[18]="Pancake"
RandomNickNames[19]="Panzer"
RandomNickNames[20]="Piston"
RandomNickNames[21]="Slinger"
RandomNickNames[22]="Sparrow"
RandomNickNames[23]="Spike"
RandomNickNames[24]="Yogi"
RandomNickNames[25]="Zarfer"
RandomNickNames_Male[0]="Chuckles"
RandomNickNames_Male[1]="Dingus"
RandomNickNames_Male[2]="Maniac"
RandomNickNames_Male[3]="Knuckles"
RandomNickNames_Male[4]="Walrus"
RandomNickNames_Female[0]="Bubbles"
RandomNickNames_Female[1]="Gadget"
RandomNickNames_Female[2]="Giggles"
RandomNickNames_Female[3]="Mango"
RandomNickNames_Female[4]="Pepper"

[SpecialistDev X2SoldierClassTemplate]
DisplayName="Specialist"
ClassSummary="Our Specialists are trained to use certain heavy weaponry, the rocket launcher and flamethrower, to provide critical support during firefights."
LeftAbilityTreeTitle="Rocketeer"
RightAbilityTreeTitle="Fireman"
AbilityTreeTitles[0]="Rocketeer"
AbilityTreeTitles[1]="Juggernaut"
AbilityTreeTitles[2]="Fireman"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Angel"
RandomNickNames[1]="Beta"
RandomNickNames[2]="Bishop"
RandomNickNames[3]="Bones"
RandomNickNames[4]="Breaker"
RandomNickNames[5]="Broker"
RandomNickNames[6]="Crypto"
RandomNickNames[7]="Cyber"
RandomNickNames[8]="Cypher"
RandomNickNames[9]="Data"
RandomNickNames[10]="Deacon"
RandomNickNames[11]="Dr. Feelgood"
RandomNickNames[12]="Doc"
RandomNickNames[13]="Feedback"
RandomNickNames[14]="Firewall"
RandomNickNames[15]="Genius"
RandomNickNames[16]="Gizmo"
RandomNickNames[17]="Glitch"
RandomNickNames[18]="Hijack"
RandomNickNames[19]="Jammer"
RandomNickNames[20]="Jester"
RandomNickNames[21]="Jolt"
RandomNickNames[22]="Lightning"
RandomNickNames[23]="Mayday"
RandomNickNames[24]="Mega"
RandomNickNames[25]="Newton"
RandomNickNames[26]="Overdrive"
RandomNickNames[27]="Patch"
RandomNickNames[28]="Professor"
RandomNickNames[29]="Ragtime"
RandomNickNames[30]="Rascal"
RandomNickNames[31]="Rattler"
RandomNickNames[32]="Red"
RandomNickNames[33]="Rift"
RandomNickNames[34]="Ripcord"
RandomNickNames[35]="Rogue"
RandomNickNames[36]="Scorch"
RandomNickNames[37]="Sentinel"
RandomNickNames[38]="Shady"
RandomNickNames[39]="Shakes"
RandomNickNames[40]="Shifter"
RandomNickNames[41]="Shrink"
RandomNickNames[42]="Slider"
RandomNickNames[43]="Solar"
RandomNickNames[44]="Sonar"
RandomNickNames[45]="Sparks"
RandomNickNames[46]="Stitch"
RandomNickNames[47]="Tapper"
RandomNickNames[48]="Teardrop"
RandomNickNames[49]="Tinker"
RandomNickNames[50]="Turbo"
RandomNickNames[51]="Venom"
RandomNickNames[52]="Vapor"
RandomNickNames[53]="Warbird"
RandomNickNames[54]="Warden"
RandomNickNames[55]="Whiskey"
RandomNickNames[56]="Wild Thing"
RandomNickNames[57]="Zulu"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[4]="Duchess"
;ALPHABETICAL ORDER

[TechnicianDev X2SoldierClassTemplate]
DisplayName="Technician"
ClassSummary="Operating some of our most advanced equipment, Technicians deploy robotic drones on the battlefield that can be outfitted for combat or field medic duty."
LeftAbilityTreeTitle="Medic"
RightAbilityTreeTitle="Hacker"
AbilityTreeTitles[0]="Medic"
AbilityTreeTitles[1]="Demolisher"
AbilityTreeTitles[2]="Hacker"
AbilityTreeTitles[3]="XCOM"

;ALPHABETICAL ORDER
RandomNickNames[0]="Angel"
RandomNickNames[1]="Beta"
RandomNickNames[2]="Bishop"
RandomNickNames[3]="Bones"
RandomNickNames[4]="Breaker"
RandomNickNames[5]="Broker"
RandomNickNames[6]="Crypto"
RandomNickNames[7]="Cyber"
RandomNickNames[8]="Cypher"
RandomNickNames[9]="Data"
RandomNickNames[10]="Deacon"
RandomNickNames[11]="Dr. Feelgood"
RandomNickNames[12]="Doc"
RandomNickNames[13]="Feedback"
RandomNickNames[14]="Firewall"
RandomNickNames[15]="Genius"
RandomNickNames[16]="Gizmo"
RandomNickNames[17]="Glitch"
RandomNickNames[18]="Hijack"
RandomNickNames[19]="Jammer"
RandomNickNames[20]="Jester"
RandomNickNames[21]="Jolt"
RandomNickNames[22]="Lightning"
RandomNickNames[23]="Mayday"
RandomNickNames[24]="Mega"
RandomNickNames[25]="Newton"
RandomNickNames[26]="Overdrive"
RandomNickNames[27]="Patch"
RandomNickNames[28]="Professor"
RandomNickNames[29]="Ragtime"
RandomNickNames[30]="Rascal"
RandomNickNames[31]="Rattler"
RandomNickNames[32]="Red"
RandomNickNames[33]="Rift"
RandomNickNames[34]="Ripcord"
RandomNickNames[35]="Rogue"
RandomNickNames[36]="Scorch"
RandomNickNames[37]="Sentinel"
RandomNickNames[38]="Shady"
RandomNickNames[39]="Shakes"
RandomNickNames[40]="Shifter"
RandomNickNames[41]="Shrink"
RandomNickNames[42]="Slider"
RandomNickNames[43]="Solar"
RandomNickNames[44]="Sonar"
RandomNickNames[45]="Sparks"
RandomNickNames[46]="Stitch"
RandomNickNames[47]="Tapper"
RandomNickNames[48]="Teardrop"
RandomNickNames[49]="Tinker"
RandomNickNames[50]="Turbo"
RandomNickNames[51]="Venom"
RandomNickNames[52]="Vapor"
RandomNickNames[53]="Warbird"
RandomNickNames[54]="Warden"
RandomNickNames[55]="Whiskey"
RandomNickNames[56]="Wild Thing"
RandomNickNames[57]="Zulu"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[4]="Duchess"
;ALPHABETICAL ORDER

[CommandoDev X2SoldierClassTemplate]
DisplayName="Commando"
ClassSummary="The Commando serves as our primary close range unit, able to push in close and hold the line."
LeftAbilityTreeTitle="Breacher"
RightAbilityTreeTitle="Marauder"
AbilityTreeTitles[0]="Breacher"
AbilityTreeTitles[1]="Gunslinger"
AbilityTreeTitles[2]="Marauder"
AbilityTreeTitles[3]="XCOM"

;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Buckeye"
RandomNickNames[3]="Butcher"
RandomNickNames[4]="Buzzsaw"
RandomNickNames[5]="Cajun"
RandomNickNames[6]="Chops"
RandomNickNames[7]="Cobra"
RandomNickNames[8]="Cougar"
RandomNickNames[9]="Coyote"
RandomNickNames[10]="Crash"
RandomNickNames[11]="Howler"
RandomNickNames[12]="Jaybird"
RandomNickNames[13]="Fatal"
RandomNickNames[14]="Flash"
RandomNickNames[15]="Fury"
RandomNickNames[16]="Gator"
RandomNickNames[17]="Ghost"
RandomNickNames[18]="Gunner"
RandomNickNames[19]="Hound Dog"
RandomNickNames[20]="Rascal"
RandomNickNames[21]="Icepick"
RandomNickNames[22]="Jaws"
RandomNickNames[23]="Judgment Day"
RandomNickNames[24]="Kinky"
RandomNickNames[25]="Monster"
RandomNickNames[26]="Mustang"
RandomNickNames[28]="Pitbull"
RandomNickNames[27]="Werewolf"
RandomNickNames[29]="Pathfinder"
RandomNickNames[30]="Ringo"
RandomNickNames[31]="Scorpion"
RandomNickNames[32]="Shadow"
RandomNickNames[33]="Slayer"
RandomNickNames[34]="Snake"
RandomNickNames[35]="Snake Eyes"
RandomNickNames[36]="Specter"
RandomNickNames[37]="Spider"
RandomNickNames[38]="Stalker"
RandomNickNames[39]="Stinger"
RandomNickNames[40]="Templar"
RandomNickNames[41]="Trojan"
RandomNickNames[42]="Vandal"
RandomNickNames[43]="Viking"
RandomNickNames[44]="Warlord"
RandomNickNames[45]="Wolverine"
RandomNickNames[46]="Wildchild"
RandomNickNames[47]="Wildling"
RandomNickNames[48]="Zulu"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Axeman"
RandomNickNames_Male[1]="Duke"
RandomNickNames_Male[2]="Rocky"
RandomNickNames_Male[3]="Stallion"
RandomNickNames_Male[4]="Wolfman"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Aunty"
RandomNickNames_Female[1]="Goodnight"
RandomNickNames_Female[2]="Medusa"
RandomNickNames_Female[3]="Sugar"
;ALPHABETICAL ORDER

[GrenadierDev X2SoldierClassTemplate]
DisplayName="Grenadier"
ClassSummary="Serving as our demolitions experts, the Grenadiers provide heavy ordnance delivery whenever and wherever we need it. They may also specialize in support grenades to protect our troops and disable our enemies."
LeftAbilityTreeTitle="Engineer"
RightAbilityTreeTitle="Support"
AbilityTreeTitles[0]="Engineer"
AbilityTreeTitles[1]="Warmonger"
AbilityTreeTitles[2]="Support"
AbilityTreeTitles[3]="XCOM"

;ALPHABETICAL ORDER
RandomNickNames[0]="All Day"
RandomNickNames[1]="All In"
RandomNickNames[2]="Animal"
RandomNickNames[3]="Baller"
RandomNickNames[4]="Big Country"
RandomNickNames[5]="Big Money"
RandomNickNames[6]="Big Nasty"
RandomNickNames[7]="Blaze"
RandomNickNames[8]="Boom Boom"
RandomNickNames[9]="Bomber"
RandomNickNames[10]="Buddy"
RandomNickNames[11]="Bulldog"
RandomNickNames[12]="Bull Rush"
RandomNickNames[13]="Claymore"
RandomNickNames[14]="Demo"
RandomNickNames[15]="Defcon"
RandomNickNames[16]="Devil Dog"
RandomNickNames[17]="Diesel"
RandomNickNames[18]="Encore"
RandomNickNames[19]="Fireball"
RandomNickNames[20]="Fridge"
RandomNickNames[21]="Gunner"
RandomNickNames[22]="Hammer"
RandomNickNames[23]="Hellfire"
RandomNickNames[24]="Hightower"
RandomNickNames[25]="Hoss"
RandomNickNames[26]="Volcano"
RandomNickNames[27]="Hurricane"
RandomNickNames[28]="Junkyard"
RandomNickNames[29]="Juggernaut"
RandomNickNames[30]="Knockout"
RandomNickNames[31]="Kong"
RandomNickNames[32]="Mad Dog"
RandomNickNames[33]="Meltdown"
RandomNickNames[34]="Moose"
RandomNickNames[35]="Nova"
RandomNickNames[36]="Nasty"
RandomNickNames[37]="Nitro"
RandomNickNames[38]="Overlord"
RandomNickNames[39]="Pitbull"
RandomNickNames[40]="Pyro"
RandomNickNames[41]="Redline"
RandomNickNames[42]="Rhino"
RandomNickNames[43]="Rocket"
RandomNickNames[44]="Seabreeze"
RandomNickNames[45]="Slab"
RandomNickNames[46]="Smash"
RandomNickNames[47]="Spitfire"
RandomNickNames[48]="Smokey"
RandomNickNames[49]="Swamp Thing"
RandomNickNames[50]="T-Bone"
RandomNickNames[51]="T-Rex"
RandomNickNames[52]="Tank"
RandomNickNames[53]="Thumper"
RandomNickNames[54]="Thunder"
RandomNickNames[55]="Tickle"
RandomNickNames[56]="Tiny"
RandomNickNames[57]="Titan"
RandomNickNames[58]="Dynamite"
RandomNickNames[59]="Torch"
RandomNickNames[60]="Wardog"
RandomNickNames[61]="Warhorse"
RandomNickNames[62]="Wildchild"
;ALPHABETICAL ORDER
RandomNicknames_Male[0]="Barbarian"
RandomNickNames_Male[1]="Big Boy"
RandomNicknames_Male[2]="Boss Man"
RandomNickNames_Male[3]="Cowboy"
RandomNickNames_Male[4]="Meathead"
RandomNickNames_Male[5]="Nero"
RandomNickNames_Male[6]="Papa Bear"
RandomNickNames_Male[7]="Wildman"
RandomNickNames_Female[0]="Amazon"
RandomNicknames_Female[1]="Boss Lady"
RandomNickNames_Female[2]="Cowgirl"
RandomNicknames_Female[3]="Domino"
RandomNickNames_Female[4]="Freya"
RandomNickNames_Female[5]="Mama Bear"
RandomNickNames_Female[6]="Deep Six"
RandomNickNames_Female[7]="Firebug"
;ALPHABETICAL ORDER

[AssassinDev X2SoldierClassTemplate]
DisplayName="Assassin"
ClassSummary="The Assassin serves as our primary scouting unit, using a sword to deliver stealthy close-range attacks."
LeftAbilityTreeTitle="Shadow"
RightAbilityTreeTitle="Blade"
AbilityTreeTitles[0]="Shadow"
AbilityTreeTitles[1]="Gun"
AbilityTreeTitles[2]="Blade"
AbilityTreeTitles[3]="XCOM"

;ALPHABETICAL ORDER
RandomNickNames[0]="Clutch"
RandomNickNames[1]="Cobra"
RandomNickNames[2]="Dagger"
RandomNickNames[3]="Dancer"
RandomNickNames[4]="Dasher"
RandomNickNames[5]="Dodger"
RandomNickNames[6]="Dragon"
RandomNickNames[7]="Fencer"
RandomNickNames[8]="Flipper"
RandomNickNames[9]="Furball"
RandomNickNames[10]="Gopher"
RandomNickNames[11]="Mace"
RandomNickNames[12]="Midnight"
RandomNickNames[13]="Neutron"
RandomNickNames[14]="Painter"
RandomNickNames[15]="Pasha"
RandomNickNames[16]="Poacher"
RandomNickNames[17]="Rattler"
RandomNickNames[18]="Razor"
RandomNickNames[19]="Ripper"
RandomNickNames[20]="Royal"
RandomNickNames[21]="Shady"
RandomNickNames[22]="Sticks"
RandomNickNames[23]="Spacebar"
RandomNickNames[24]="Splinter"
RandomNickNames[25]="Stalker"
RandomNickNames[26]="Talon"
RandomNickNames[27]="Undertaker"
RandomNickNames[28]="Wildcat"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Bender"
RandomNickNames_Male[1]="Cochise"
RandomNickNames_Male[2]="Slim"
RandomNickNames_Male[3]="Jockey"
RandomNickNames_Male[4]="Sandman"
RandomNickNames_Male[5]="Swordsman"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Panther"
RandomNickNames_Female[1]="Siren"
RandomNickNames_Female[2]="Sparkplug"
RandomNickNames_Female[3]="Spitfire"
;ALPHABETICAL ORDER

[MarineDev X2SoldierClassTemplate]
DisplayName="Marine"
ClassSummary="The Marine is a bastion on the field, capable of stalling large armies with a swift arcthrower shot. They also serve as capable corpsmen, providing vital first aid to injured teammates."
LeftAbilityTreeTitle="Defender"
RightAbilityTreeTitle="Corpsman"
AbilityTreeTitles[0]="Defender"
AbilityTreeTitles[1]="Riot Control"
AbilityTreeTitles[2]="Corpsman"
AbilityTreeTitles[3]="XCOM"

RandomNickNames[0]="Bronco"
RandomNickNames[1]="Buck"
RandomNickNames[2]="Brick"
RandomNickNames[3]="Cobalt"
RandomNickNames[4]="Cowboy"
RandomNickNames[5]="Digger"
RandomNickNames[6]="Dinger"
RandomNickNames[7]="Frosty"
RandomNickNames[8]="Grunt"
RandomNickNames[9]="Hollywood"
RandomNickNames[10]="Hoss"
RandomNickNames[11]="Diamond"
RandomNickNames[12]="Enforcer"
RandomNickNames[13]="Jayhawk"
RandomNickNames[14]="Judge"
RandomNickNames[15]="Marlin
RandomNickNames[16]="Mustang"
RandomNickNames[17]="Pappy"
RandomNickNames[18]="Painter"
RandomNickNames[19]="Pinto"
RandomNickNames[20]="Ice"
RandomNickNames[21]="Rocky"
RandomNickNames[22]="Scooter"
RandomNickNames[23]="Skeeter"
RandomNickNames[24]="Skids"
RandomNickNames[25]="Stretch"
RandomNickNames[26]="Thumper"
RandomNickNames[27]="Paladin"
RandomNickNames[28]="Samurai"
RandomNickNames[29]="Shogun"
RandomNickNames[30]="Solo"
RandomNickNames[31]="Steel"
RandomNickNames[32]="Warden"
RandomNickNames_Male[0]="Dusty"
RandomNickNames_Male[1]="Dutch"
RandomNickNames_Male[2]="Husker"
RandomNickNames_Male[3]="Slick"
RandomNickNames_Male[4]="Pops"
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"

[PsionDev X2SoldierClassTemplate]
+DisplayName="Psion"
+ClassSummary="Very few are naturally psionically gifted and even fewer are able to awaken that power without intensive training. Psions fight in a way that defies previously known logic and have the potential to become powerful assets against the Elders. While they focus primarily on the use of their powers they have been equipped with Assault Rifles as a means of fighting enemies in a more conventional way."
+LeftAbilityTreeTitle=""
+RightAbilityTreeTitle=""
+AbilityTreeTitles[0]="Sorcerer"
+AbilityTreeTitles[1]="Telepath"
+AbilityTreeTitles[2]="Cleric"
+AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Acolyte"
+RandomNickNames[1]="Dreameater"
+RandomNickNames[2]="Druid"
+RandomNickNames[3]="Haze"
+RandomNickNames[4]="Hex"
+RandomNickNames[5]="Magus"
+RandomNickNames[6]="Malaise"
+RandomNickNames[7]="Mystic"
+RandomNickNames[8]="Nightmare"
+RandomNickNames[9]="Shaman"
+RandomNickNames[10]="Souleater"
+RandomNickNames[11]="Voidwalker"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Necron"
+RandomNickNames_Male[1]="Wizard"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Nightshade"
+RandomNickNames_Female[1]="Tharja"
+RandomNickNames_Female[2]="Witch"

+RankNames[0]="Rookie"
+RankNames[1]="Initiate"
+RankNames[2]="Acolyte"
+RankNames[3]="Adept"
+RankNames[4]="Disciple"
+RankNames[5]="Mystic"
+RankNames[6]="Warlock"
+RankNames[7]="Magus"
+RankNames[8]="Master"

+ShortNames[0]="Rk."
+ShortNames[1]="Int."
+ShortNames[2]="Acl."
+ShortNames[3]="Adp."
+ShortNames[4]="Dsc."
+ShortNames[5]="Mys."
+ShortNames[6]="War."
+ShortNames[7]="Mag."
+ShortNames[8]="Mas."

+RankIcons[0]= "UILibrary_Common.rank_rookie"
+RankIcons[1]= "UILibrary_Common.psirank_initiate"
+RankIcons[2]= "UILibrary_Common.psirank_acolyte"
+RankIcons[3]= "UILibrary_Common.psirank_adept"
+RankIcons[4]= "UILibrary_Common.psirank_disciple"
+RankIcons[5]= "UILibrary_Common.psirank_mystic"
+RankIcons[6]= "UILibrary_Common.psirank_warlock"
+RankIcons[7]= "UILibrary_Common.psirank_magus"
+RankIcons[8]= "UILibrary_Common.psirank_magus"

[Spark X2SoldierClassTemplate]
RankNames[8]="Templar"
ShortNames[8]="Tpr."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Common.rank_squaddie"
RankIcons[2]="UILibrary_Common.rank_lieutenant"
RankIcons[3]="UILibrary_Common.rank_sergeant"
RankIcons[4]="UILibrary_Common.rank_captain"
RankIcons[5]="UILibrary_Common.rank_major"
RankIcons[6]="UILibrary_Common.rank_colonel"
RankIcons[7]="UILibrary_Common.rank_commander"
RankIcons[8]="UILibrary_Common.rank_fieldmarshall"

;************************************************************************************************************
;END FILE
;************************************************************************************************************
